-- MySQL dump 10.13  Distrib 5.7.17, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: classmanagement
-- ------------------------------------------------------
-- Server version	5.7.21-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `teacher_info`
--

DROP TABLE IF EXISTS `teacher_info`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `teacher_info` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `teacher_id` varchar(11) NOT NULL,
  `teacher_name` varchar(45) DEFAULT NULL,
  `first_semester_expect` float DEFAULT NULL,
  `second_semester_expect` float DEFAULT NULL,
  `first_semester_hours` float DEFAULT NULL,
  `second_semester_hours` float DEFAULT NULL,
  `first_semester_degree` float DEFAULT NULL,
  `second_semester_degree` float DEFAULT NULL,
  `teacher_apply_done` varchar(45) DEFAULT NULL,
  `notes` varchar(2000) DEFAULT NULL,
  `insert_time` timestamp(6) NOT NULL DEFAULT CURRENT_TIMESTAMP(6) ON UPDATE CURRENT_TIMESTAMP(6),
  `lock_state` tinyint(4) DEFAULT '0',
  `major` varchar(45) DEFAULT NULL,
  `teacher_type` varchar(45) DEFAULT NULL,
  `teacher_title` varchar(45) DEFAULT NULL,
  `birthday` date DEFAULT NULL,
  `sex` varchar(45) DEFAULT NULL,
  `update_time` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `teacher_id_UNIQUE` (`teacher_id`)
) ENGINE=InnoDB AUTO_INCREMENT=71 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `teacher_info`
--

LOCK TABLES `teacher_info` WRITE;
/*!40000 ALTER TABLE `teacher_info` DISABLE KEYS */;
INSERT INTO `teacher_info` VALUES (1,'31043','孙笑侠',1,1,90,72,16,12,'申报结束',NULL,'2019-04-18 04:30:47.214735',0,'法学理论','博导','教授','1963-08-10','男','2019-04-12 15:15:23'),(2,'00058','侯健',1,1,72,126,14,21,'申报结束',NULL,'2019-04-18 04:30:47.409082',0,'法学理论,教育法学','博导','教授','1968-12-14','男','2019-04-12 15:15:23'),(3,'20549','张光杰',1,1,90,90,14,16,'申报结束',NULL,'2019-04-18 04:30:47.490586',0,'法学理论','硕导','副教授','1963-09-26','男','2019-04-12 15:15:23'),(4,'04753','史大晓',1,1,108,108,16,17,'申报结束',NULL,'2019-04-18 04:30:46.971263',0,'法学理论','硕导','副教授','1976-05-20','男','2019-04-12 15:15:23'),(5,'34004','杨晓畅',1,1,108,72,16,14,'申报结束',NULL,'2019-04-18 04:30:46.887556',0,'法学理论','硕导','副教授','1983-11-29','女','2019-04-12 15:15:23'),(6,'BH5054','刘天骄',1,1,126,54,23,9,'申报结束',NULL,'2019-04-18 04:30:47.931998',0,'法学理论','非硕博导','博士后','1997-09-15','女','2019-04-12 15:15:23'),(7,'20558','郭建',1,1,90,108,16,19,'申报结束','去年和今年我分别新开了JM的法律与人文、法律与商业两门课程，是否现在已经取消？','2019-04-18 04:30:47.233995',0,'法律史','博导','教授','1956-09-13','男','2019-04-12 15:15:23'),(8,'00028','王志强',0.5,0.5,NULL,108,NULL,21,'申报结束','党政联席会成员教学工作量减半','2019-04-18 04:30:47.912041',0,'法律史','博导','教授','1971-10-13','男','2019-04-12 15:15:23'),(9,'20390','赵立行',1,1,90,72,14,12,'申报结束','我找不出我不符合要求的理由，我的专业课程中没有达到所设定难度系数的课程，同时我也不想乱选打扰排课程序，请领导斟酌。','2019-04-18 04:30:47.035659',0,'法律史','博导','教授','1966-08-11','男','2019-04-12 15:15:23'),(10,'09120','韩涛',1,1,90,NULL,14,NULL,'申报结束',NULL,'2019-04-18 04:30:47.256626',0,'法律史','硕导','副教授','1977-05-15','男','2019-04-12 15:15:23'),(11,'38241','赖骏楠',0.6,1.4,90,72,14,14,'申报结束',NULL,'2019-04-18 04:30:47.904624',0,'法律史','非硕博导','副教授','1985-09-08','男','2019-04-12 15:15:23'),(12,'36033','孟烨',1,1,36,NULL,7,NULL,'申报结束','......','2019-04-18 04:30:48.010258',0,'法律史','硕导（专业硕士）','讲师','1983-11-06','女','2019-04-12 15:15:23'),(13,'20557','张乃根',1,1,54,108,9,14,'申报结束',NULL,'2019-04-18 04:30:47.659311',0,'国际法学','博导','教授','1955-10-18','男','2019-04-12 15:15:23'),(14,'20588','龚柏华',1,1,90,90,12,14,'申报结束',NULL,'2019-04-18 04:30:47.824986',0,'国际法学','博导','教授','1962-09-24','男','2019-04-12 15:15:23'),(15,'04310','陈梁',1,1,54,144,7,26,'申报结束',NULL,'2019-04-18 04:30:47.969159',0,'国际法学','博导','教授','1959-04-13','男','2019-04-12 15:15:23'),(16,'04445','孙南申',1,1,54,108,5,14,'申报结束','1、本人专业领域内没有9学分的课程；2、法律硕士培养方案中国际私法的课程取消了；本科的国际私法课程因培养方案的改革本学年没有排课。','2019-04-18 04:30:46.631775',0,'国际法学','博导','教授','1950-01-13','男','2019-04-12 15:15:23'),(17,'90093','何力',1,1,36,108,7,19,'申报结束','2020年6月预计退休，不再承担本科课程。','2019-04-18 04:30:47.474633',0,'国际法学','博导','教授','1955-06-25','男','2019-04-12 15:15:23'),(18,'20589','陈力',1,1,90,108,12,19,'申报结束','因承担相应的行政工作，申请选课通过','2019-04-18 04:30:48.022334',0,'国际法学','博导','教授','1966-10-10','女','2019-04-12 15:15:23'),(19,'05410','马忠法',1,1,54,72,7,14,'申报结束',NULL,'2019-04-18 04:30:48.037289',0,'国际法学,人权法学','博导','教授','1966-10-20','男','2019-04-12 15:15:23'),(20,'07339','王伟',1,1,36,108,9,19,'申报结束',NULL,'2019-04-18 04:30:47.149085',0,'国际法学,教育法学','博导','教授','1970-07-15','男','2019-04-12 15:15:23'),(21,'20591','陆志安',1,1,54,162,9,26,'申报结束',NULL,'2019-04-18 04:30:47.252239',0,'国际法学','硕导','副教授','1964-05-13','男','2019-04-12 15:15:23'),(22,'04695','高凌云',1,1,108,144,14,23,'申报结束',NULL,'2019-04-18 04:30:47.718514',0,'国际法学','硕导','教授','1968-06-27','女','2019-04-12 15:15:23'),(23,'04751','梁咏',1,1,36,108,7,19,'申报结束',NULL,'2019-04-18 04:30:46.954130',0,'国际法学','硕导','副教授','1979-07-24','女','2019-04-12 15:15:23'),(24,'34082','朱丹',1,1,54,144,9,19,'申报结束',NULL,'2019-04-18 04:30:47.878700',0,'国际法学','硕导（专业硕士）','讲师','1983-06-12','女','2019-04-12 15:15:23'),(25,'00143','章武生',1,1,144,72,21,14,'申报结束',NULL,'2019-04-18 04:30:47.676408',0,'诉讼法学','博导','教授','1954-11-26','男','2019-04-12 15:15:23'),(26,'04166','马贵翔',1,1,72,108,14,19,'申报结束',NULL,'2019-04-18 04:30:47.624195',0,'诉讼法学','博导','教授','1964-11-21','男','2019-04-12 15:15:23'),(27,'04915','段厚省',1,1,72,90,14,16,'申报结束',NULL,'2019-04-18 04:30:47.058174',0,'诉讼法学','博导','教授','1970-08-16','男','2019-04-12 15:15:23'),(28,'07330','杨严炎',1,1,54,126,7,19,'申报结束',NULL,'2019-04-18 04:30:46.936952',0,'诉讼法学','博导','教授','1977-07-15','女','2019-04-12 15:15:23'),(29,'04208','徐美君',1,1,54,144,7,23,'申报结束',NULL,'2019-04-18 04:30:47.524115',0,'诉讼法学','硕导','教授','1971-01-12','女','2019-04-12 15:15:23'),(30,'34161','熊浩',1,1,36,54,7,12,'申报结束','由于法律谈判是平行班，也就是两个大班，所以实际上已经选够7门课；思辨与创新之前叫做法科学生的创业与创新，去年标准为9分，今年调整为了7分，故相关要求没有完成。和去年相比，选课数量没有变化。','2019-04-18 04:30:46.708480',0,'诉讼法学','硕导（专业硕士）','副教授','1983-11-16','男','2019-04-12 15:15:23'),(31,'04948','刘志刚',1,1,90,72,14,12,'申报结束',NULL,'2019-04-18 04:30:47.775538',0,'宪法学与行政法学','博导','教授','1971-04-16','男','2019-04-12 15:15:23'),(32,'90016','潘伟杰',1,1,126,72,23,14,'申报结束','因本人要承担学校招生管理工作，请学院谅解并支持！','2019-04-18 04:30:47.561330',0,'宪法学与行政法学','博导','教授','1971-12-29','男','2019-04-12 15:15:23'),(33,'60038','朱淑娣',1,1,126,72,21,12,'申报结束',NULL,'2019-04-18 04:30:47.134761',0,'宪法学与行政法学','博导','教授','1958-10-17','女','2019-04-12 15:15:23'),(34,'20550','王蔚',1,1,90,36,16,7,'申报结束',NULL,'2019-04-18 04:30:46.670056',0,'宪法学与行政法学','硕导','副教授','1964-04-18','女','2019-04-12 15:15:23'),(35,'35001','杜仪方',1,1,36,90,9,14,'申报结束','  ','2019-04-18 04:30:47.951346',0,'宪法学与行政法学','硕导','副教授','1982-11-12','女','2019-04-12 15:15:23'),(36,'02009','姚军',1.5,1.5,162,72,28,16,'申报结束',NULL,'2019-04-18 05:56:36.700319',0,'宪法学与行政法学','硕导（专业硕士）','高级讲师','1960-08-27','男','2019-04-12 15:15:23'),(37,'34077','涂云新',1,1,144,54,19,9,'申报结束',NULL,'2019-04-18 04:30:47.552027',0,'宪法学与行政法学','硕导（专业硕士）','讲师','1981-11-24','男','2019-04-12 15:15:23'),(38,'04465','汪明亮',1,1,108,180,16,33,'申报结束',NULL,'2019-04-18 04:30:46.826062',0,'刑法学','博导','教授','1969-03-01','男','2019-04-12 15:15:23'),(39,'04754','杜宇',0.5,0.5,108,72,14,12,'申报结束','班子成员按照一般标准的50%申报。','2019-04-18 04:30:47.703481',0,'刑法学','博导','教授','1976-10-17','男','2019-04-12 15:15:23'),(40,'37158','袁国何',0.8,1.2,144,108,21,16,'申报结束',NULL,'2019-04-18 04:30:47.178595',0,'刑法学','非硕博导','讲师','1987-09-01','男','2019-04-12 15:15:23'),(41,'07344','张梓太',1,1,54,108,7,17,'申报结束',NULL,'2019-04-18 04:30:46.902175',0,'环境与资源保护法学','博导','教授','1964-09-01','男','2019-04-12 15:15:23'),(42,'08081','李传轩',1,1,NULL,126,NULL,23,'申报结束','承担较多行政事务，根据学院党政联席会议讨论决定，按照4-2-1要求申报','2019-04-18 04:30:46.909002',0,'环境与资源保护法学','硕导','副教授','1978-12-08','男','2019-04-12 15:15:23'),(43,'34075','陶蕾',1,1,54,72,7,16,'申报结束',NULL,'2019-04-18 04:30:47.580231',0,'环境与资源保护法学','硕导','副教授','1977-06-09','女','2019-04-12 15:15:23'),(44,'20572','胡鸿高',1,1,90,36,14,5,'申报结束','以上为本人能承担的课程。','2019-04-18 04:30:47.647447',0,'民商法学,经济法学','博导','教授','1954-09-10','男','2019-04-12 15:15:23'),(45,'20414','季立刚',1,1,54,108,9,21,'申报结束',NULL,'2019-04-18 04:30:47.739845',0,'民商法学,经济法学,金融法学','博导','教授','1964-09-07','男','2019-04-12 15:15:23'),(46,'04641','张建伟',1,1,72,90,14,16,'申报结束','以上课程为可承担的课程','2019-04-18 04:30:46.737126',0,'民商法学,经济法学','博导','教授','1971-04-25','男','2019-04-12 15:15:23'),(47,'38363','许多奇',1,1,90,108,14,21,'申报结束','财税法刚和经济法一样，作为本科核心课程，应该作为基础课看待，且经济法学科至少有一到两门9','2019-04-18 04:30:47.758035',0,'民商法学,经济法学,金融法学','博导（待认定）','教授','1974-09-01','女','2019-04-12 15:15:23'),(48,'04466','许凌艳',1,1,54,72,7,16,'申报结束',NULL,'2019-04-18 04:30:47.462752',0,'民商法学,经济法学','硕导','副教授','1974-03-20','女','2019-04-12 15:15:23'),(49,'07041','李小宁',1,1,90,36,12,7,'申报结束',NULL,'2019-04-18 04:30:46.660023',0,'民商法学,经济法学','硕导','副教授','1972-03-20','女','2019-04-12 15:15:23'),(50,'37061','陈立',1,1,72,36,12,7,'申报结束',NULL,'2019-04-18 04:30:47.504060',0,'经济法学,法律史','硕导（专业硕士）','青年副研究员','1980-11-09','男','2019-04-12 15:15:23'),(51,'04736','刘士国',1,1,162,90,21,12,'申报结束',NULL,'2019-04-18 06:05:27.504037',0,'民商法学','博导','教授','1954-11-08','男','2019-04-12 15:15:23'),(52,'31087','李世刚',1,1,NULL,108,NULL,19,'申报结束','学院行政工作（421）','2019-04-18 04:30:47.937265',0,'民商法学','博导','教授','1977-12-06','男','2019-04-12 15:15:23'),(53,'00027','白国栋',1,1,90,90,16,14,'申报结束',NULL,'2019-04-18 04:30:48.002757',0,'民商法学','硕导','副教授','1960-09-23','男','2019-04-12 15:15:23'),(54,'20570','孙晓屏',1,1,126,72,21,14,'申报结束',NULL,'2019-04-18 04:30:47.982033',0,'民商法学','硕导','副教授','1962-11-27','女','2019-04-12 15:15:23'),(55,'06120','蒋云蔚',1,1,NULL,NULL,NULL,NULL,NULL,NULL,'2019-04-17 15:59:32.534227',0,'民商法学','硕导','副教授','1977-08-12','女','2019-04-12 15:15:23'),(56,'34086','班天可',1,1,108,54,16,7,'申报结束',NULL,'2019-04-18 04:30:47.163759',0,'民商法学','硕导（专业硕士）','讲师','1983-03-08','男','2019-04-12 15:15:23'),(57,'20569','王俊',0,1.5,54,126,7,21,'申报结束','1、可选课程资源有限；2、学年前期即第一学期拟出国进修，担当全日制课程有实际困难；3、难度系数为9的课程，可能是由于本科必修课的原因，导致命中数超过牙咯虬数。','2019-04-18 06:05:27.777034',0,'民商法学','非硕博导','讲师','1964-07-01','男','2019-04-12 15:15:23'),(58,'37036','丁文杰',1,1,126,72,21,16,'申报结束',NULL,'2019-04-18 06:05:27.734554',0,'民商法学','非硕博导','讲师','1983-08-01','男','2019-04-12 15:15:23'),(59,'37228','葛江虬',1,1,18,72,7,12,'申报结束','本欲申报的“合同法”课程因课程改革原因从培养方案中消失，此事已向王院长、李院长、熊老师汇报。','2019-04-18 04:30:47.427706',0,'民商法学','非硕博导','讲师','1988-04-01','男','2019-04-12 15:15:23'),(60,'38214','施鸿鹏',1,1,144,90,21,16,'申报结束',NULL,'2019-04-18 06:05:27.834637',0,'民商法学','非硕博导','讲师','1990-12-01','男','2019-04-12 15:15:23'),(61,'T0002','教学院长',1,1,NULL,NULL,NULL,NULL,NULL,NULL,'2019-04-18 04:27:49.454440',1,'','','','2019-04-12','','2019-04-12 15:15:23'),(62,'T0001','实务导师1',1,1,NULL,NULL,NULL,NULL,NULL,NULL,'2019-04-18 04:25:00.931463',1,'','','','2019-04-12','','2019-04-12 15:15:23'),(63,'T0003','待定老师1',1,1,NULL,NULL,NULL,NULL,NULL,NULL,'2019-04-18 04:27:07.619581',1,'','','','2019-04-12','','2019-04-12 15:15:23'),(64,'T0004','待定老师2',1,1,NULL,NULL,NULL,NULL,NULL,NULL,'2019-04-18 04:27:07.633892',1,'','','','2019-04-12','','2019-04-12 15:15:23'),(65,'T0005','何瑾',1,1,NULL,NULL,NULL,NULL,NULL,NULL,'2019-04-18 04:27:49.479356',1,'','','','2019-04-12','','2019-04-12 15:15:23'),(66,'T0006','刘丽君',1,1,NULL,NULL,NULL,NULL,NULL,NULL,'2019-04-18 04:27:49.479135',1,'','','','2019-04-12','','2019-04-12 15:15:23'),(67,'T0007','GuoPeng',1,1,NULL,NULL,NULL,NULL,NULL,NULL,'2019-04-18 04:27:49.478931',1,'','','','2019-04-12','','2019-04-12 15:15:23'),(68,'T0008','翁小川',1,1,NULL,NULL,NULL,NULL,NULL,NULL,'2019-04-18 04:27:49.478703',1,'','','','2019-04-12','','2019-04-12 15:15:23'),(69,'T0009','林曦',1,1,NULL,NULL,NULL,NULL,NULL,NULL,'2019-04-18 04:27:49.478411',1,'','','','2019-04-12','','2019-04-12 15:15:23'),(70,'T0010','外籍教师',1,1,NULL,NULL,NULL,NULL,NULL,NULL,'2019-04-18 04:25:15.483648',1,'','','','2019-04-12','','2019-04-12 15:15:23');
/*!40000 ALTER TABLE `teacher_info` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-04-18 15:29:55
